other_question = {
    39: {'Бикуспидальная анатомия': ['Тип 1',
                                     'Тип 2',
                                     'Тип 3']
         },
    46: {'Да': ['Главный ствол ЛКА',
                'Передняя межжелудочковая артерия',
                'Огибающая артерия',
                'Правая коронарная артерия'],
         "multiselect": True
         },
    53: {'Да': ['Восходящая аорта',
                'Дуга аорты',
                'Грудная аорта',
                'Брюшная аорта'],
         "multiselect": True
         },
    64: {'Medtronic': ['CoreValve',
                       'Evolut R',
                       'Evolut Pro',
                       'Evolut Pro+'],
         "Abbott": ['PORTICO',
                    'Navitor'],
         "Boston Scientific": ['AСURATE neo',
                               'AСURATE neo2']
         },
    72: {'Да': ['Реканализация, стентирование',
                'Реканализация, баллонная ангиопластика',
                'Коронарное шунтирование']
         },
    74: {'Эндоваскулярно (ушивающие устройства)': ['PROSTAR',
                                                   '2x ProGlide',
                                                   'ProGlide и Angio-Seal']
         }
}
