dict_questions = {
    1: {
        "message": "Учреждение",
        "list_buttons":
            ['НМИЦ им. В.А. Алмазова',
             'Городская многопрофильная больница №2',
             'СЗГМУ им. И.И. Мечникова',
             'ПСПБГМУ им. акад. И.П. Павлова',
             'Федеральный центр высоких медицинских технологий г. Калининград',
             'Городская Мариинская больница',
             'Клиника высоких медицинских технологий им. Н.И. Пирогова СПбГУ',
             'Городская больница №40',
             'Областная клиническая больница им. П.А. Баяндина',
             'ВМА им. С.М. Кирова', 'Городская Покровская больница',
             'Областная клиническая больница г. Архангельск',
             'МЧС ВЦЭРМ им А.М. Никифорова',
             'Клиническая больница РАН',
             'ООО “Инномед” г. Архангельск ',
             'Госпиталь для ветеранов войн',
             ' Клиническая больница № 122 имени Л. Г. Соколова',
             'Ленинградская областная клиническая больница'],
        "multiselect": False
    },
    2: {
        "message": "ФИО оператора",
        "list_buttons": []
    },
    3: {
        "message": "Вид ассигнования операции TAVI",
        "list_buttons": ['ВМП-II',
                         'ВМП-III',
                         'Клиническая апробация',
                         'ПМУ',
                         'ДМС']
    },
    4: {
        "message": "Процедура клапан в клапан",
        "list_buttons": ['TAVI в TAVI',
                         'TAVI в клапан',
                         'Нет']

    },
    5: {
        "message": "Инициалы пациента (ФИО)",
        "list_buttons": []
    },
    6: {
        "message": "Номер истории болезни",
        "list_buttons": []
    },
    7: {
        "message": "Дата выполнения операции TAVI (ДД-ММ-ГГГГ)",
        "list_buttons": []
    },
    8: {
        "message": "Пол пациента",
        "list_buttons": ['Мужской',
                         'Женский']
    },
    9: {
        "message": "Возраст пациента",
        "list_buttons": []
    },
    10: {
        "message": "Рост пациента",
        "list_buttons": []
    },
    11: {
        "message": "Вес пациента",
        "list_buttons": []
    },
    12: {
        "message": "Значение по шкале EuroSCORE II <a href='https://medsoftpro.ru/kalkulyatory/euroscore-2.html'>Калькулятор</a>",
        "list_buttons": []
    },
    13: {
        "message": "Значение по шкале STS Score <a href='https://acsdriskcalc.research.sts.org/'>Калькулятор</a>",
        "list_buttons": []
    },
    14: {
        "message": "Давность информирования о наличии клапананного порока",
        "list_buttons": ['Впервые выявленный',
                         'Более 1 года',
                         'Более 3 лет',
                         'Более 5 лет',
                         'Более 10 лет']
    },
    15: {
        "message": "Рекомендовалось ли оперативное лечение ранее",
        "list_buttons": ['Да, протезирование аортального клапана',
                         'Операция TAVI',
                         'Нет']
    },
    16: {
        "message": "Предшествующие операции на аорте или клапанном аппарате",
        "list_buttons": ['Да',
                         'Нет']
    },
    17: {
        "message": "Предшествующая операция АКШ/МКШ",
        "list_buttons": ['Да',
                         'Нет']
    },
    18: {
        "message": " Предшествующие операции ЧКВ",
        "list_buttons": ['Да',
                         'Нет']
    },
    19: {
        "message": "Функционально-клиническая характеристика аортального стеноза",
        "list_buttons": ['Симптомный',
                        'Асимптомный']
    },
    20: {
        "message": "Наличие артериальной гипертензии",
        "list_buttons": ['Да',
                         'Нет']
    },
    21: {
        "message": "Наличие сахарного диабета",
        "list_buttons": ['I тип',
                         'II тип',
                         'Нет']
    },
    22: {
        "message": "Наличие ХОБЛ",
        "list_buttons": ['Да',
                         'Нет']
    },
    23: {
        "message": "Наличие ХБП",
        "list_buttons": ['С1 стадия',
                         'С2 стадия',
                         'С3а стадия',
                         'С3б стадия',
                         'C4 стадия',
                         'С5 стадия',
                         'Нет']
    },
    24: {
        "message": "Наличие ФП",
        "list_buttons": ['Пароксизмальная',
                         'Персистирующая',
                         'Постоянная',
                         'Нет']
    },
    25: {
        "message": "Ранее зафиксированные нарушения ритма и проводимости",
        "list_buttons": ['Да',
                         'Нет']
    },
    26: {
        "message": "Ранее перенесенный ИМ",
        "list_buttons": ['Да',
                         'Нет']
    },
    27: {
        "message": "Наличие ХСН",
        "list_buttons": ['I ФК',
                         'II ФК',
                         'III ФК',
                         'IV ФК',
                         'Нет']
    },
    28: {
        "message": " Ранее перенесенный ОНМК",
        "list_buttons": ['Да',
                         'Нет']
    },
    29: {
        "message": "Сопутствующая онкологическая патология",
        "list_buttons": ['Да',
                         'Нет']
    },
    30: {
        "message": "Поражение периферических артерий",
        "list_buttons": ['Да',
                         'Нет']
    },
    31: {
        "message": "Ранее имплантированный ПЭКС",
        "list_buttons": ['Да',
                         'Нет']
    },
    32: {
        "message": "Ранее выполненная вальвулопластика аортального клапана",
        "list_buttons": ['Да',
                         'Нет']
    },
    33: {
        "message": "Фракция выброса ЛЖ по Симпсону  до операции (%)",
        "list_buttons": []
    },
    34: {
        "message": "Максимальная скорость АоК до операции (м/с)",
        "list_buttons": []
    },
    35: {
        "message": "Средний градиент АоК до операции (мм рт. ст.)",
        "list_buttons": []
    },
    36: {
        "message": "Максимальный градиент АоК до операции (мм рт. ст.)",
        "list_buttons": []
    },
    37: {
        "message": "Полезная площадь отверстия АоК до операции (см2)",
        "list_buttons": []
    },
    38: {
        "message": "Регургитация АоК до операции (Указать степень)",
        "list_buttons": []
    },
    39: {
        "message": "Анатомическая характеристика АоК",
        "list_buttons": ['Бикуспидальная анатомия',
                         'Трикуспидальная анатомия']
    },
    40: {
        "message": "Субаортальный стеноз до операции",
        "list_buttons": ['Да',
                         'Нет']
    },
    41: {
        "message": "Стеноз МК до операции",
        "list_buttons": ['Да',
                         'Нет']
    },
    42: {
        "message": "Регургитация МК до операции",
        "list_buttons": ['Да',
                         'Нет']
    },
    43: {
        "message": "Стеноз ТК до операции",
        "list_buttons": ['Да',
                         'Нет']
    },
    44: {
        "message": "Регургитация ТК до операции",
        "list_buttons": ['Да',
                         'Нет']
    },
    45: {
        "message": "Расчётное давление в ЛА до операции (мм рт. ст.)",
        "list_buttons": []
    },
    46: {
        "message": "Поражение крупных эпикардиальных артерий по данным коронарографии (стеноз ≥ 75%) до операции TAVI",
        "list_buttons": ['Да',
                         'Нет']
    },
    47: {
        "message": "Площадь фиброзного кольца АоК по данным МСКТ (мм2)",
        "list_buttons": []
    },
    48: {
        "message": "Ширина Синусов Вальсальвы по данным МСКТ (мм) ",
        "list_buttons": []
    },
    49: {
        "message": "Высота отхождения ПКА по данным МСКТ (мм)",
        "list_buttons": []
    },
    50: {
        "message": "Высота отхождения ЛКА по данным МСКТ (мм)",
        "list_buttons": []
    },
    51: {
        "message": "Кальциноз АоК по данным МСКТ",
        "list_buttons": ['Отсутствует',
                         'Умеренный',
                         'Выраженный']
    },
    52: {
        "message": "Распространение кальция по данным МСКТ (Возможность множественного выбора)",
        "list_buttons": ['Створки АоК',
                         'Фиброзное кольцо',
                         'Выносящий тракт ЛЖ',
                         'Аорта',
                         'Митрально-аортальный контакт'],
        "multiselect": True
    },
    53: {
        "message": "Расширение аорты по данным МСКТ",
        "list_buttons": ['Да',
                         'Нет']
    },
    54: {
        "message": "Горизонтальная анатомия аорты по данным МСКТ (Угол корня аорты ≥ 45)",
        "list_buttons": ['Да',
                         'Нет']
    },
    55: {
        "message": "Фарфоровая аорта по данным МСКТ",
        "list_buttons": ['Да',
                         'Нет']
    },
    56: {
        "message": "Атеросклеротическое кальцинированное поражение в месте основного доступа по данным МСКТ",
        "list_buttons": ['Да',
                         'Нет']
    },
    57: {
        "message": "Основой доступ для выполнения операции TAVI",
        "list_buttons": ['Трансфеморальный',
                         'Трансаортальный',
                         'Трансапикальный',
                         'Подключичный',
                         'Через общую сонную артерию',
                         'Другой']
    },
    58: {
        "message": "Вид анестезии",
        "list_buttons": ['Общая анестезия',
                         'Местная анестезия']
    },
    59: {
        "message": "Метод выполнения доступа",
        "list_buttons": ['Пункционный',
                         'Открытый']
    },
    60: {
        "message": "Способ выполнения сверхчастой стимуляции",
        "list_buttons": ['Через электрод в ПЖ',
                         'Через проводник в ЛЖ',
                         'Ранее установленный ПЭКС']
    },
    61: {
        "message": "Использование системы церебральной защиты от эмболии",
        "list_buttons": ['Да',
                         'Нет']
    },
    62: {
        "message": "Дополнительный доступ",
        "list_buttons": ['Трансфеморальный',
                         'Радиальный',
                         'Брахиальный']
    },
    63: {
        "message": "Тип протеза",
        "list_buttons": ['Баллонорасширяемый',
                         'Саморасширяющийся']
    },
    64: {
        "message": "Модель и производитель биопротеза",
        "list_buttons": ['Medtronic',
                         'Abbott',
                         'Boston Scientific',
                         'Meril - Myval THV',
                         'Microport - VitaFlow',
                         'SMT - Hydra',
                         'Venus Microport',
                         'МедИнж']
    },
    65: {
        "message": "Предалитация АоК",
        "list_buttons": ['Да',
                         'Нет']
    },
    66: {
        "message": "Постдилатация АоК",
        "list_buttons": ['Да',
                         'Нет']
    },
    67: {
        "message": "Имплантация дополнительного клапана",
        "list_buttons": ['Да',
                         'Нет']
    },
    68: {
        "message": "Осложнение в месте доступа",
        "list_buttons": ['Окклюзия',
                         'Стеноз',
                         'Кровотечение',
                         'Нет']
    },
    69: {
        "message": "Развитие полной АВ-блокады, требующей применения ВЭКС",
        "list_buttons": ['Да',
                         'Нет']
    },
    70: {
        "message": "Миграция имплантируемого устройства",
        "list_buttons": ['Да',
                         'Нет']
    },
    71: {
        "message": "Разрыв фиброзного кольца",
        "list_buttons": ['Да',
                         'Нет']
    },
    72: {
        "message": "Окклюзия коронарных артерий",
        "list_buttons": ['Да',
                         'Нет']
    },
    73: {
        "message": "Технический успех имплантации",
        "list_buttons": ['Да',
                         'Нет']
    },
    74: {
        "message": "Способ ушивания артериального доступа",
        "list_buttons": ['Эндоваскулярно (ушивающие устройства)',
                         'Хирургически']
    },
    75: {
        "message": "Полная АВ-блокада требующая имплантации ПЭКС в послеоперационном периоде",
        "list_buttons": ['Да',
                         'Нет']
    },
    76: {
        "message": "Острое нарушение мозгового кровообращения в послеоперационном периоде",
        "list_buttons": ['Да',
                         'Нет']
    },
    77: {
        "message": "Фракция выброса ЛЖ по Симпсону после операции (%)",
        "list_buttons": []
    },
    78: {
        "message": "Максимальная скорость АоК после операции (м/с)",
        "list_buttons": []
    },
    79: {
        "message": "Средний градиент АоК после операции (мм рт. ст.)",
        "list_buttons": []
    },
    80: {
        "message": "Максимальный градиент АоК после операции (мм рт. ст.)",
        "list_buttons": []
    },
    81: {
        "message": "Полезная площадь отверстия АоК после операции (см2)",
        "list_buttons": []
    },
    82: {
        "message": "Паравальвулярная регургитация АоК после операции ",
        "list_buttons": ['Да',
                         'Нет']
    },
    83: {
        "message": "Субаортальный стеноз после операции",
        "list_buttons": ['Да',
                         'Нет']
    },
    84: {
        "message": "Расчётное давление в ЛА после операции (мм рт. ст.)",
        "list_buttons": []
    },
    85: {
        "message": "Летальный исход",
        "list_buttons": ['Да',
                         'Нет']
    },
    86: {
        "message": "Количество дней в стационаре",
        "list_buttons": []
    },
    87: {
        "message": "Дополнительные комментарии",
        "list_buttons": []
    }
}
