dict_questions = {
    1: {
        "message": "Учреждение",
        "list_buttons":
            ['НМИЦ им. В.А. Алмазова',
             'Городская многопрофильная больница №2',
             'СЗГМУ им. И.И. Мечникова',
             'ПСПБГМУ им. акад. И.П. Павлова',
             'Федеральный центр высоких медицинских технологий г. Калининград',
             'Городская Мариинская больница',
             'Клиника высоких медицинских технологий им. Н.И. Пирогова СПбГУ',
             'Городская больница №40',
             'Областная клиническая больница им. П.А. Баяндина',
             'ВМА им. С.М. Кирова', 'Городская Покровская больница',
             'Областная клиническая больница г. Архангельск',
             'МЧС ВЦЭРМ им А.М. Никифорова',
             'Клиническая больница РАН',
             'ООО “Инномед” г. Архангельск ',
             'Госпиталь для ветеранов войн',
             ' Клиническая больница № 122 имени Л. Г. Соколова',
             'Ленинградская областная клиническая больница']
    },
    2: {
        "message": "ФИО оператора",
        "list_buttons": []
    },
    3: {
        "message": "Вид ассигнования",
        "list_buttons": ['ВМП-II',
                         'ВМП-III',
                         'Клиническая апробация',
                         'ПМУ',
                         'ДМС']
    },
    4: {
        "message": "Инициалы пациента (ФИО)",
        "list_buttons": []
    },
    5: {
        "message": "Номер истории болезни",
        "list_buttons": []
    },
    6: {
        "message": "Дата выполнения операции TAVI",
        "list_buttons": []
    },
    7: {
        "message": "Пол пациента",
        "list_buttons": ['Мужской',
                         'Женский']
    },
    8: {
        "message": "Возраст пациента",
        "list_buttons": []
    },
    9: {
        "message": "Рост пациента",
        "list_buttons": []
    },
    10: {
        "message": "Вес пациента",
        "list_buttons": []
    },
    11: {
        "message": "Значение по шкале EuroSCORE II",
        "list_buttons": []
    },
    12: {
        "message": "Значение по шкале STS Score",
        "list_buttons": []
    },
    13: {
        "message": "Значение по шкале The Edmonton Frailty Scale",
        "list_buttons": []
    },
    14: {
        "message": "Давность информирования о наличии клапананного порока",
        "list_buttons": ['Впервые выявленный',
                         'Более 1 года',
                         'Более 3 лет',
                         'Более 5 лет',
                         'Более 10 лет']
    },
    15: {
        "message": "Рекомендовалось ли оперативное лечение ранее",
        "list_buttons": ['Да, протезирование аортального клапана',
                         'Операция TAVI',
                         'Нет']
    },
    16: {
        "message": "Предшествующие операции на аорте или клапанном аппарате (Объем оперативного вмешательства,"
                   " год выполнения)",
        "list_buttons": []
    },
    17: {
        "message": "Предшествующая операция АКШ/МКШ (Объем оперативного вмешательства, год выполнения)",
        "list_buttons": []
    },
    18: {
        "message": " Предшествующие операции ЧКВ (Объем оперативного вмешательства, год выполнения)",
        "list_buttons": []
    },
    19: {
        "message": "Функционально-клиническая характеристика аортального стеноза",
        "list_buttons": ['Симптомный',
                         'Асимптомный']
    },
    20: {
        "message": "Наличие артериальной гипертензии",
        "list_buttons": ['Да',
                         'Нет']
    },
    21: {
        "message": "Наличие сахарного диабета",
        "list_buttons": ['I тип',
                         'II тип',
                         'Нет']
    },
    22: {
        "message": "Наличие ХОБЛ",
        "list_buttons": ['Да',
                         'Нет']
    },
    23: {
        "message": "Наличие ХБП",
        "list_buttons": ['С1 стадия',
                         'С2 стадия',
                         'С3а стадия',
                         'С3б стадия',
                         'C4 стадия',
                         'С5 стадия']
    },
    24: {
        "message": "Наличие ФП",
        "list_buttons": ['Пароксизмальная',
                         'Персистирующая',
                         'Постоянная']
    },
    25: {
        "message": "Ранее зафиксированные нарушения ритма и проводимости (указать какие)",
        "list_buttons": []
    },
    26: {
        "message": "Ранее перенесенный ИМ",
        "list_buttons": ['Да',
                         'Нет']
    },
    27: {
        "message": "Наличие ХСН",
        "list_buttons": ['I ФК',
                         'II ФК',
                         'III ФК',
                         'IV ФК']
    },
    28: {
        "message": " Ранее перенесенный ОНМК",
        "list_buttons": ['Да',
                         'Нет']
    },
    29: {
        "message": "Сопутствующая онкологическая патология",
        "list_buttons": ['Да',
                         'Нет']
    },
    30: {
        "message": "Поражение периферических артерий",
        "list_buttons": ['Да',
                         'Нет']
    },
    31: {
        "message": "Ранее имплантированный ПЭКС",
        "list_buttons": ['Да',
                         'Нет']
    },
    32: {
        "message": "Ранее выполненная вальвулопластика аортального клапана",
        "list_buttons": ['Да',
                         'Нет']
    },
    33: {
        "message": "Фракция выброса ЛЖ по Симпсону  до операции (%)",
        "list_buttons": []
    },
    34: {
        "message": "Максимальная скорость АоК до операции (м/с)",
        "list_buttons": []
    },
    35: {
        "message": "Средний градиент АоК до операции (мм рт. ст.)",
        "list_buttons": []
    },
    36: {
        "message": "Максимальный градиент АоК до операции (мм рт. ст.)",
        "list_buttons": []
    },
    37: {
        "message": "Полезная площадь отверстия АоК до операции (см2)",
        "list_buttons": []
    },
    38: {
        "message": "Стеноз АоК до операции (Указать степень)",
        "list_buttons": []
    },
    39: {
        "message": "Регургитация АоК до операции (Указать степень)",
        "list_buttons": []
    },
    40: {
        "message": "Анатомическая характеристика АоК",
        "list_buttons": ['Бикуспидальная анатомия',
                         'Трикуспидальная анатомия']
    },
    41: {
        "message": "Субаортальный стеноз до операции (Указать Да/Нет; данные ЭхоКГ)",
        "list_buttons": []
    },
    42: {
        "message": "Стеноз МК до операции (Указать степень)",
        "list_buttons": []
    },
    43: {
        "message": "Регургитация МК до операции (Указать степень)",
        "list_buttons": []
    },
    44: {
        "message": "Стеноз ТК до операции (Указать степень)",
        "list_buttons": []
    },
    45: {
        "message": "Регургитация ТК до операции (Указать степень)",
        "list_buttons": []
    },
    46: {
        "message": "Расчётное давление в ЛА до операции (мм рт. ст.)",
        "list_buttons": []
    },
    47: {
        "message": "Данные коронарографии до операции (Указать стенозы более 75%)",
        "list_buttons": []
    },
    48: {
        "message": "Ранее выполненное Стресс-ЭхоКГ исследование с добутамином"
                   " (В случае выполнения вписать результат исследования)",
        "list_buttons": []
    },
    49: {
        "message": " Анатомическая характеристика АоК (Бикуспидальный (Тип сращения)/Трикуспидальный)",
        "list_buttons": ['Бикуспидальный (Тип 1)',
                         'Бикуспидальный (Тип 2)',
                         'Бикуспидальный (Тип 3)',
                         'Трикуспидальный']
    },
    50: {
        "message": "Площадь фиброзного кольца АоК по данным МСКТ (мм2)",
        "list_buttons": []
    },
    51: {
        "message": "Ширина Синусов Вальсальвы по данным МСКТ (мм) ",
        "list_buttons": []
    },
    52: {
        "message": "Высота отхождения ПКА по данным МСКТ (мм)",
        "list_buttons": []
    },
    53: {
        "message": "Высота отхождения ЛКА по данным МСКТ (мм)",
        "list_buttons": []
    },
    54: {
        "message": "Длина нативной створки АоК (Указать длину правой и левой створок, если выполнялся расчет, мм)",
        "list_buttons": []
    },
    55: {
        "message": "Кальциноз АоК по данным МСКТ",
        "list_buttons": ['Отсутствует',
                         'Умеренный',
                         'Выраженный']
    },
    56: {
        "message": "Распространение кальция по данным МСКТ",
        "list_buttons": ['Створки АоК',
                         'Фиброзное кольцо',
                         'Выносящий тракт ЛЖ',
                         'Аорта',
                         'Митрально-аортальный контакт']
    },
    57: {
        "message": "Площадь выносящего тракта ЛЖ по данным МСКТ (мм2)",
        "list_buttons": []
    },
    58: {
        "message": "Расширение аорты по данным МСКТ (Указать отдел и диаметр в случае её расширения, мм)",
        "list_buttons": []
    },
    59: {
        "message": "Горизонтальная анатомия аорты по данным МСКТ",
        "list_buttons": ['Да',
                         'Нет']
    },
    60: {
        "message": "Фарфоровая аорта по данным МСКТ",
        "list_buttons": ['Да',
                         'Нет']
    },
    61: {
        "message": "Поражение периферических артерий по данным МСКТ (Указать локализацию и характер поражения)",
        "list_buttons": []
    },
    62: {
        "message": "Основой доступ для выполнения операции TAVI",
        "list_buttons": ['Трансфеморальный',
                         'Трансаортальный',
                         'Трансапикальный',
                         'Подключичный',
                         'Через общую сонную артерию',
                         'Другой']
    },
    63: {
        "message": "Вид анестезии",
        "list_buttons": ['Общая анестезия',
                         'Местная анестезия']
    },
    64: {
        "message": "Метод выполнения доступа",
        "list_buttons": ['Пункционный',
                         'Открытый']
    },
    65: {
        "message": "Способ выполнения сверхчастой стимуляции",
        "list_buttons": ['Через электрод в ПЖ',
                         'Через проводник в ЛЖ',
                         'Ранее установленный ПЭКС']
    },
    66: {
        "message": "Использование системы церебральной защиты от эмболии",
        "list_buttons": ['Да',
                         'Нет']
    },
    67: {
        "message": "Дополнительный доступ (в случае потребности)",
        "list_buttons": ['Трансфеморальный',
                         'Радиальный',
                         'Брахиальный']
    },
    68: {
        "message": "Основой дополнительный доступ для выполнения операции TAVI",
        "list_buttons": ['Трансфеморальный',
                         'Трансаортальный',
                         'Трансапикальный',
                         'Подключичный',
                         'Через общую сонную артерию',
                         'Другой']
    },
    69: {
        "message": "Тип протеза",
        "list_buttons": ['Баллонорасширяемый',
                         'Саморасширяющийся']
    },
    70: {
        "message": "Модель и производитель биопротеза (Указать название имплантируемого протеза)",
        "list_buttons": ['Через электрод в ПЖ',
                         'Через проводник в ЛЖ',
                         'Другое']
    },
    71: {
        "message": "Кровотечение в месте доступа",
        "list_buttons": ['Да',
                         'Нет']
    },
    72: {
        "message": "Способ остановки кровотечения",
        "list_buttons": ['Мануальный гемостаз',
                         'Имплантация стент-графта',
                         'Открытое вмешательство']
    },
    73: {
        "message": "Процедура клапан в клапан (указать ранее установленный протез/Нет)",
        "list_buttons": []
    },
    74: {
        "message": "Предалитация АоК",
        "list_buttons": ['Да',
                         'Нет']
    },
    75: {
        "message": "Постдилатация АоК",
        "list_buttons": ['Да',
                         'Нет']
    },
    76: {
        "message": "Имплантация дополнительного клапана",
        "list_buttons": ['Да',
                         'Нет']
    },
    77: {
        "message": "Модель и производитель дополнительного биопротеза "
                   "(Указать название дополнительного имплантируемого протеза/Нет)",
        "list_buttons": []
    },
    78: {
        "message": "Развитие полной АВ-блокады, требующей применения ВЭКС",
        "list_buttons": ['Да',
                         'Нет']
    },
    79: {
        "message": "Миграция имплантируемого устройства",
        "list_buttons": ['Да',
                         'Нет']
    },
    80: {
        "message": "Разрыв фиброзного кольца",
        "list_buttons": ['Да',
                         'Нет']
    },
    81: {
        "message": "Окклюзия коронарных артерий",
        "list_buttons": ['Да',
                         'Нет']
    },
    82: {
        "message": "Способ восстановления кровотока по коронарным артериям",
        "list_buttons": ['Реканализация, стентирование',
                         'Реканализация, баллонная ангиопластика',
                         'Коронарное шунтирование']
    },
    83: {
        "message": "Технический успех имплантации",
        "list_buttons": ['Да',
                         'Нет']
    },
    84: {
        "message": "Способ ушивания артериального доступа",
        "list_buttons": ['Эндоваскулярно (ушивающие устройства)',
                         'Хирургически']
    },
    85: {
        "message": "Летальный исход",
        "list_buttons": ['Да',
                         'Нет']
    },
    86: {
        "message": "Полная АВ-блокада требующая имплантации ПЭКС в послеоперационном периоде",
        "list_buttons": ['Да',
                         'Нет']
    },
    87: {
        "message": "Острое нарушение мозгового кровообращения в послеоперационном периоде",
        "list_buttons": ['Да',
                         'Нет']
    },
    88: {
        "message": "Фракция выброса ЛЖ по Симпсону после операции (%)",
        "list_buttons": []
    },
    89: {
        "message": "Максимальная скорость АоК после операции (м/с)",
        "list_buttons": []
    },
    90: {
        "message": "Средний градиент АоК после операции (мм рт. ст.)",
        "list_buttons": []
    },
    91: {
        "message": "Максимальный градиент АоК после операции (мм рт. ст.)",
        "list_buttons": []
    },
    92: {
        "message": "Полезная площадь отверстия АоК после операции (см2)",
        "list_buttons": []
    },
    93: {
        "message": "Стеноз АоК после операции (Указать степень)",
        "list_buttons": []
    },
    94: {
        "message": "Регургитация АоК после операции (Указать степень)",
        "list_buttons": []
    },
    95: {
        "message": "Субаортальный стеноз после операции (Указать Да/Нет; данные ЭхоКГ)",
        "list_buttons": []
    },
    96: {
        "message": "Расчётное давление в ЛА после операции (мм рт. ст.)",
        "list_buttons": []
    },
    97: {
        "message": "Количество дней в стационаре",
        "list_buttons": []
    }
}
